Change sequence diagram format to Mermaid
